#pragma once
#ifndef _DBNODE_H
#define _DBNODE_H

#include "define.h"
#include <string>
using namespace std;

/*****************************************************************************
* @author  : Jiajun Chang,Hongguang Zhao                                                             *
* @date    : 
* @file    : 
* @brief   : 储存一个数据库的库元数据，20字节数据库名称，4字节用户表的数量
*****************************************************************************/
class dbNode {
public:

	/*****************************************************************************
	* @name    : dbNode
	* @input   : 数据库名称(不带路径)
	* @output  : void
	* @brief   : 创建对象并初始化
	*****************************************************************************/
	dbNode(string name);



	/*****************************************************************************
	* @name    : dbNode
	* @input   : 从库元数据表中获取的字节数组
	* @output  : void
	* @brief   : 将从库元数据表中获取的字节数组转换为对应的库元数据对象
	*****************************************************************************/
	dbNode(char* bytearray);



	/*****************************************************************************
	* @name    : getDBName
	* @input   : void
	* @output  : 数据库名称，string类型
	* @brief   : 获取数据库名称
	*****************************************************************************/
	string getDBName(void);



	/*****************************************************************************
	* @name    : getTableNum
	* @input   : void
	* @output  : 数据库中用户数据表的数量
	* @brief   : 获取用户数据表的数量
	*****************************************************************************/
	int getTableNum(void);



	/*****************************************************************************
	* @name    : incNum
	* @input   : void
	* @output  : void 
	* @brief   : 使tableNum+1
	*****************************************************************************/
	void incNum();



	/*****************************************************************************
	* @name    : decNum
	* @input   : void
	* @output  : void
	* @brief   : 使tableNum-1
	*****************************************************************************/
	void decNum();



	/*****************************************************************************
	* @name    : toString
	* @input   : void
	* @output  : string
	* @brief   : 获取一个数据库的信息
	*****************************************************************************/
	string toString();



	/*****************************************************************************
	* @name    : toByte
	* @input   : void
	* @output  : 该库元信息对应的字节数组
	* @brief   : 获取库元信息对应的字节数组
	*****************************************************************************/
	char* toByte();





private:
	string dbName;		/*数据库名称*/
	int tableNum;		/*数据库中用户表的数量*/
};


#endif
