#pragma once
#ifndef _COLNODE_H
#define _COLNODE_H

#include "define.h"
#include<string>

using namespace std;


/*****************************************************************************
* @author  : Jiajun Chang,Hongguang Zhao                                                             *
* @date    :
* @file    :
* @brief   : 列元数据类
*****************************************************************************/
class colNode {
public:


	/*****************************************************************************
	* @name    : colNode
	* @input   :
	* @output  :
	* @brief   : 无参构造函数
	*****************************************************************************/
	colNode();

	/*****************************************************************************
	* @name    : colNode
	* @input   :
	* @output  :
	* @brief   : 普通构造函数
	*****************************************************************************/
	colNode(string colName,string tableName,char colType,int colLength,int order);




	/*****************************************************************************
	* @name    : colNode
	* @input   :
	* @output  :
	* @brief   : 根据从文件中读取的字节数组构造列元数据对象
	*****************************************************************************/
	colNode(char* bytearray);



	/*****************************************************************************
	* @name    : getColName
	* @input   :
	* @output  :
	* @brief   : 获取列名
	*****************************************************************************/
	string getColName();

	void setColName(string colname);



	/*****************************************************************************
	* @name    : getTableName
	* @input   :
	* @output  :
	* @brief   : 获取列所属表的名称
	*****************************************************************************/
	string getTableName();

	void setTableName(string tablename);


	/*****************************************************************************
	* @name    : colType
	* @input   :
	* @output  :
	* @brief   : 获取列的数据类型
	*****************************************************************************/
	char getColType();

	void setColType(int coltype);


	/*****************************************************************************
	* @name    : getColLength
	* @input   :
	* @output  :
	* @brief   : 获取列的长度
	*****************************************************************************/
	int getColLength();

	void setColLength(int collength);


	/*****************************************************************************
	* @name    : getOrder
	* @input   :
	* @output  :
	* @brief   : 获取列在元组中的顺序
	*****************************************************************************/
	int getOrder();

	void setOrder(int order);




	/*****************************************************************************
	* @name    : copy
	* @input   :
	* @output  :
	* @brief   : 将另一个给定的colNode对象的数据成员的值copy到此对象中
	*****************************************************************************/
	void copy(colNode* node);


	/*****************************************************************************
	* @name    : toByte
	* @input   :
	* @output  :
	* @brief   : 将列元数据对象转换为字节数组
	*****************************************************************************/
	char* toByte();




private:
	string colName;		/*列名*/
	string tableName;	/*所属的表的名称*/
	char colType;		/*列的数据类型(单字节存储),2--string,3--int*/
	int colLength;		/*列的长度(若为string类型,包含了一位的'\0')*/
	int order;			/*该列在元组中的顺序*/
};



#endif